# -*- coding: utf-8 -*-
from data_base import DataBase
import datetime

db = DataBase("diary", False, ("School", "text"), ("Class", "text"), ("Week", "integer"),
              ("Schedule", "text[][][]"))
db.connect()
# db.kill_base()
# db.add_data("МАОУ Лицей №6", "11А",
#             datetime.date.today().isocalendar()[1],
#             '{'
#             '{{"Информатика", "§30"}, '
#             '{"Информатика", "§31"}, '
#             '{"Химия", "параграф 14 упр. 2-4"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Литература", "Не задано"}, '
#             '{"Литература", "Не задано"}}, '
#
#             '{{"Информатика", "§30"}, '
#             '{"Информатика", "§31"}, '
#             '{"Химия", "параграф 14 упр. 2-4"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Литература", "Не задано"}, '
#             '{"Литература", "Не задано"}}, '
#
#             '{{"Информатика", "§30"}, '
#             '{"Информатика", "§31"}, '
#             '{"Химия", "параграф 14 упр. 2-4"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Литература", "Не задано"}, '
#             '{"Литература", "Не задано"}}, '
#
#             '{{"Информатика", "§30"}, '
#             '{"Информатика", "§31"}, '
#             '{"Химия", "параграф 14 упр. 2-4"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Литература", "Не задано"}, '
#             '{"Литература", "Не задано"}}, '
#
#             '{{"Информатика", "§30"}, '
#             '{"Информатика", "§31"}, '
#             '{"Химия", "параграф 14 упр. 2-4"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Литература", "Не задано"}, '
#             '{"Литература", "Не задано"}}, '
#
#             '{{"Информатика", "§30"}, '
#             '{"Информатика", "§31"}, '
#             '{"Химия", "параграф 14 упр. 2-4"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Математика", "Не задано"}, '
#             '{"Литература", "Не задано"}, '
#             '{"Литература", "Не задано"}}'
#             '}')

# db = DataBase("peoples", False, ("Surname", "text PRIMARY KEY"), ("Password", "text"),
#               ("School", "text"), ("Class", "text"), ("Character", "text"))
# db.connect()

# db.add_data("Мухортов", "0000", "МАОУ Лицей №6", "11A", "Ученик")
# db.add_data("Учитель1", "1111", "МАОУ Лицей №6", "0", "Учитель")
# db.add_data("1", "1", "МАОУ Лицей №6", "0", "Ученик")

db.print()
db.disconnect()
