# -*- coding: utf-8 -*-
import datetime

from data_base import DataBase

db = DataBase("diary", False, ("School", "text"), ("Class", "text"), ("Week", "integer"),
              ("Schedule", "text[][][]"))
db.connect()
# db.kill_base()
db.add_data("МАОУ Лицей №6", "11А",
            datetime.date.today().isocalendar()[1],
            '{'
            '{{"Информатика", "§30"}, '
            '{"Информатика", "§31"}, '
            '{"Химия", "параграф 14 упр. 2-4"}, '
            '{"Математика", "вариант 2, часть 2 № 12, 14, 15, 17 (Ященко И.В.)"}, '
            '{"Математика", ""}, '
            '{"Литература", ""}, '
            '{"Литература", ""}, '
            '{"Спецкурс по математике", ""}}, '

            '{{"Математика", "п. 61, 62, 63, № 555, 558, 568"}, '
            '{"Математика", ""}, '
            '{"История", "принести 3 часть учебника Истории России"}, '
            '{"Физика", ""}, '
            '{"Физика", ""}, '
            '{"", ""}, '
            '{"", ""}, '
            '{"", ""}}, '

            '{{"", ""}, '
            '{"ОБЖ", "Правовые основы военной службы"}, '
            '{"Обществознание", "§31"}, '
            '{"Физ-ра", "параграф 14 упр. 2-4"}, '
            '{"Литература", ""}, '
            '{"Английский", "стр 63 № В наизусть"}, '
            '{"Физика", ""}, '
            '{"", ""}}, '

            '{{"Математика", ""}, '
            '{"Математика", ""}, '
            '{"Физ-ра", ""}, '
            '{"Английский", ""}, '
            '{"Проект", "Записи в тетради"}, '
            '{"Информатика", ""}, '
            '{"Информатика", ""}, '
            '{"", ""}}, '

            '{{"Математика", ""}, '
            '{"Математика", ""}, '
            '{"Физика", ""}, '
            '{"Английский", ""}, '
            '{"Физика", ""}, '
            '{"Русский яз", ""}, '
            '{"Родной...", ""}, '
            '{"", ""}}, '

            '{{"Шахматы", ""}, '
            '{"История", ""}, '
            '{"География", ""}, '
            '{"Биология", "§17, 18"}, '
            '{"Общество", ""}, '
            '{"", ""}, '
            '{"", ""}, '
            '{"", ""}} '
            '}')

# db = DataBase("peoples", False, ("Surname", "text PRIMARY KEY"), ("Password", "text"),
#               ("School", "text"), ("Class", "text"), ("Character", "text"))
# db.connect()

# db.add_data("Мухортов", "0000", "МАОУ Лицей №6", "11A", "Ученик")
# db.add_data("Учитель1", "1111", "МАОУ Лицей №6", "0", "Учитель")
# db.add_data("1", "1", "МАОУ Лицей №6", "0", "Ученик")
# db.add_data("Админ666", "666", "МАОУ Лицей №6", "0", "Админ")

db.print()
db.disconnect()
